CREATE TABLE Departments(
	[Id]  INT  NOT NULL  PRIMARY KEY IDENTITY,
	[Financing]  MONEY  NOT NULL   DEFAULT 0,
	[Name]   NVARCHAR(100)  NOT NULL UNIQUE
)

INSERT INTO Departments ([Name], [Financing]) VALUES
-- факультет IT
(N'Кафедра програмної інженерії', 152000.00),
(N'Кафедра комп''ютерних наук', 178500.00),
(N'Кафедра інформаційних систем', 167300.00),
(N'Кафедра кібербезпеки', 198900.00),
-- факультет менеджменту
(N'Кафедра економічної теорії', 122500.00),
(N'Кафедра фінансів', 133000.00),
(N'Кафедра маркетингу', 117200.00),
(N'Кафедра менеджменту', 126800.00),
-- факультет іноземних мов
(N'Кафедра англійської мови', 95500.00),
(N'Кафедра німецької мови', 88500.00),
(N'Кафедра романських мов', 92500.00),
-- факультет архітектури
(N'Кафедра архітектури', 202500.00),
(N'Кафедра дизайну', 173800.00),
(N'Кафедра містобудування', 187200.00),
-- факультет математики
(N'Кафедра вищої математики', 142300.00),
(N'Кафедра прикладної математики', 153800.00),
(N'Кафедра фізики', 146500.00)
