CREATE TABLE Groups(
	[Id]  INT  NOT NULL  PRIMARY KEY IDENTITY,
	[Name]  NVARCHAR(10)  NOT NULL  UNIQUE,
	[Rating]  INT  NOT NULL,
	[Year]    INT  NOT NULL
)

INSERT INTO Groups ([Name], [Rating], [Year]) VALUES
-- Факультет ІТ
(N'IT-101', 85, 1),
(N'IT-102', 78, 1),
(N'IT-103', 82, 1),
(N'IT-201', 92, 2),
(N'IT-202', 88, 2),
(N'IT-301', 95, 3),
(N'IT-302', 91, 3),
(N'IT-401', 90, 4),
(N'IT-402', 93, 4),
-- Факультет економіки
(N'EC-101', 82, 1),
(N'EC-102', 79, 1),
(N'EC-201', 86, 2),
(N'EC-202', 84, 2),
(N'EC-301', 91, 3),
(N'EC-401', 89, 4),
-- Факультет права
(N'LAW-101', 83, 1),
(N'LAW-102', 80, 1),
(N'LAW-201', 87, 2),
(N'LAW-301', 93, 3),
(N'LAW-401', 88, 4),
-- Факультет іноземних мов
(N'FL-101', 80, 1),
(N'FL-102', 77, 1),
(N'FL-201', 84, 2),
(N'FL-301', 89, 3),
(N'FL-401', 86, 4),
-- Факультет архітектури та дизайну
(N'AD-101', 81, 1),
(N'AD-201', 85, 2),
(N'AD-301', 94, 3),
(N'AD-401', 92, 4),
-- Факультет математики
(N'MAT-101', 87, 1),
(N'MAT-201', 90, 2),
(N'MAT-301', 94, 3),
(N'MAT-401', 91, 4),
-- Медичний факультет
(N'MED-101', 88, 1),
(N'MED-201', 92, 2),
(N'MED-301', 96, 3),
(N'MED-401', 95, 4),
-- Факультет біології
(N'BIO-101', 83, 1),
(N'BIO-201', 86, 2),
(N'BIO-301', 90, 3);
