CREATE TABLE Teachers(
	[Id]  INT NOT NULL PRIMARY KEY IDENTITY,
	[EmploymentDate]  DATE  NOT NULL,
	[Name]  NVARCHAR(MAX)  NOT NULL,
	[Premium]  MONEY  NOT NULL DEFAULT 0,
	[Salary]  MONEY  NOT NULL,
	[Surname]  NVARCHAR(MAX)  NOT NULL
)

INSERT INTO Teachers ([Id], [Name], [Surname], [EmploymentDate], [Salary], [Premium]) VALUES

-- Викладачі комп'ютерних наук
(N'Дмитро', N'Кравчук', '1995-09-01', 25500.00, 5200.00),
(N'Анастасія', N'Гриценко', '2000-03-15', 28250.00, 6100.00),
(N'Тарас', N'Семененко', '1998-08-20', 30500.00, 7200.00),
(N'Макар', N'Іваненко', '2007-02-14', 28700.00, 6300.00),
(N'Олег', N'Морозенко', '1997-08-25', 32300.00, 7600.00),

-- Викладачі менеджменту
(N'Ірина', N'Бондар', '2005-02-10', 22300.00, 4100.00),
(N'Світлана', N'Ткачева', '2008-01-15', 27200.00, 5900.00),
(N'Юрій', N'Лисенко', '2012-09-01', 24300.00, 4600.00),
(N'Наталія', N'Костенко', '2001-02-20', 30700.00, 7100.00),

-- Викладачі медицини
(N'Микола', N'Мельниченко', '2010-09-01', 26300.00, 5600.00),
(N'Андрій', N'Кравчук', '1992-07-01', 35200.00, 8200.00),
(N'Владислав', N'Руденко', '2002-01-10', 31300.00, 7300.00),

-- Викладачі іноземних мов
(N'Софія', N'Волошина', '2003-03-20', 29200.00, 6600.00),
(N'Тетяна', N'Савченко', '2015-09-01', 21200.00, 3600.00),
(N'Віктор', N'Романенко', '2011-09-01', 25700.00, 5400.00),
(N'Ірина', N'Павленко', '2016-09-01', 20250.00, 3100.00),

-- Викладачі архітектури
(N'Антоніна', N'Захарова', '2013-09-02', 23200.00, 4300.00),
(N'Олег', N'Сидоренко', '1999-09-01', 29750.00, 6700.00),
(N'Світлана', N'Козаченко', '2009-03-15', 26750.00, 5700.00),
(N'Роман', N'Білоусов', '2014-09-01', 22750.00, 4200.00),

-- Викладачі математики та фізики
(N'Василь', N'Литвин', '1993-09-01', 33200.00, 7900.00),
(N'Галина', N'Мартин', '2006-02-15', 27750.00, 6000.00),
(N'Михайло', N'Яремчук', '2004-09-01', 29200.00, 6500.00),
(N'Оксана', N'Даниленко', '2017-09-01', 19750.00, 2900.00),

-- Викладачі біології
(N'Степан', N'Демченко', '1999-09-01', 29150.00, 6400.00),
(N'Лариса', N'Онищук', '2011-03-15', 24700.00, 4900.00);



